INSERT INTO weekdays(name)
VALUES ('Понедельник'),
    ('Вторник'),
    ('Среда'),
    ('Четверг'),
    ('Пятница'),
    ('Суббота');
INSERT INTO disciplines (name)
VALUES ('Иностранный язык'),
    ('Математика'),
    ('Социология'),
    ('Административное право'),
    ('Информационные технологии'),
    ('Физическая культура и спорт'),
    ('Программная инженерия');
INSERT INTO lesson_times (time)
VALUES ('8:30 - 10:00'),
    ('10:10 - 11:40'),
    ('11:50 - 13:20'),
    ('13:50 - 15:20'),
    ('15:30 - 17:00'),
    ('17:10 - 18:40');
INSERT INTO groups (name)
VALUES ('ГМУ-111'),
    ('УП-111'),
    ('ЭБ-111'),
    ('МЕН-112'),
    ('ЭБ-112'),
    ('МЕН-113'),
    ('МЕН-114'),
    ('ЭБ-113'),
    ('ИСТ-311'),
    ('МЕН-122'),
    ('МЕН-123'),
    ('МЕН-124'),
    ('УП-121'),
    ('ГМУ-121'),
    ('СЕР-121');
INSERT INTO teachers (name)
VALUES ('Баранов В.И.'),
    ('Карпова Е.М.'),
    ('Рябикина Е.В.'),
    ('Абдулрахман Х.Н.'),
    ('Руденко А.Н.'),
    ('Казимирова Н.Г.'),
    ('Долженко А.И.'),
    ('Щетинин А.А.'),
    ('ЧУВЕНКОВ А.Ф.'),
    ('ПОПОВА Л.К.'),
    ('Жаброва Т.А.'),
    ('Дунайцева Н.А.');
INSERT INTO rooms(name)
VALUES ('ауд.333'),
    ('ауд.222'),
    ('ауд.111'),
    ('ауд.333'),
    ('ауд.212'),
    ('ауд.121'),
    ('ауд.*403'),
    ('ауд.*307'),
    ('ауд..*312/д'),
    ('ауд..*310/д'),
    ('ауд.*405'),
    ('ауд..*404/д');
INSERT INTO lesson_types (name)
VALUES ('Лабороторная'),
    ('Практика'),
    ('Лекция');
INSERT INTO lesson (
        week_is_odd,
        weekday,
        teacher,
        discipline,
        room,
        time
    )
VALUES (true, 2, 2, 3, 5, 1),
    (true, 1, 7, 2, 5, 2),
    (true, 2, 3, 4, 5, 3),
    (true, 5, 5, 5, 5, 1),
    (false, 3, 2, 3, 5, 2),
    (false, 1, 2, 2, 5, 1),
    (false, 2, 3, 4, 5, 1),
    (false, 5, 5, 5, 5, 2),
    (true, 3, 7, 3, 3, 3),
    (false, 3, 7, 3, 3, 3);
    
INSERT INTO lessonGroups (
    "group",
    lesson
) VALUES (9, 1), (5,2), (3,3), (3,4), (5,5), (9,6), (9,7), (9,8), (2,9), (9,10), (8,8), (9,9), (2,2), (3,9);